In [2]:
import pandas as pd

In [ ]:
# Dataframe is a 2-d array like a table which mean there is rows and columns and we need both to arrive to a valid data point unlike series
# in other words df is basically a table that each columns is a series!

# Creating a Data Frame

In [3]:
sample_dict = {"Names": ["Isaac", "John","Peter"], "Age": [22,32,45]}
# one way
pd.DataFrame.from_dict(sample_dict)

   Names  Age
0  Isaac   22
1   John   32
2  Peter   45

In [5]:
sample_dict = {"Names": ["Isaac", "John","Peter"], "Age": [22,32,45]}
# one way
pd.DataFrame.from_dict(sample_dict, orient="index") # the "orientation" of the dataframe. if the keys should be rows, pass 'index' otherwise pass "columns"
#when using orient = index you can specify columns manaually i.e
pd.DataFrame.from_dict(sample_dict, orient="index", columns=["name1","name2", "name3"])
# second way
pd.DataFrame(list(sample_dict.items()), columns=["Name", "Age"]) # .items in python 3 its a view object hence the list

    Name                   Age
0  Names  [Isaac, John, Peter]
1    Age          [22, 32, 45]

In [10]:
sample_dict = {"Names": ["Isaac", "John","Peter"], "Age": [22,32,45]}
# one way
pd.DataFrame.from_dict(sample_dict, orient="index") # the "orientation" of the dataframe. if the keys should be rows, pass 'index' otherwise pass "columns"
#when using orient = index you can specify columns manaually i.e
#pd.DataFrame.from_dict(sample_dict, orient="index", columns=["name1","name2", "name3"])
# second way

           0     1      2
Names  Isaac  John  Peter
Age       22    32     45

# Dataframe from a file

In [13]:
#nba = pd.read_csv("nbasalariespoints.csv")
nba = pd.read_csv("nbasalariespoints.csv", usecols = ["Player", "Pos", "Age", "TEAM", "SALARY"])
nba.head() # defaul is 5
#nba.tail(0)

             Player Pos   Age                   TEAM      SALARY
0     Stephen Curry  PG  27.0  Golden State Warriors  11,370,786
1      James Harden  SG  26.0        Houston Rockets  15,756,438
2      Kevin Durant  SF  27.0  Oklahoma City Thunder  20,158,622
3  DeMarcus Cousins   C  25.0       Sacramento Kings  15,851,950
4      LeBron James  SF  31.0    Cleveland Cavaliers  22,970,500

In [26]:
#as in Series:
nba.head()
nba.tail()
nba.shape
print(nba.dtypes)
nba.index
nba.columns
nba.axes

Player     object
Pos        object
Age       float64
TEAM       object
SALARY     object
dtype: object

[RangeIndex(start=0, stop=517, step=1),
 Index(['Player', 'Pos', 'Age', 'TEAM', 'SALARY'], dtype='object')]

In [27]:
# exclusive in dataframe
nba.info() # pay attention to the different numbers and the types of each row

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 517 entries, 0 to 516
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Player  517 non-null    object
 1   Pos     476 non-null    object
 2   Age     476 non-null    float64
 3   TEAM    420 non-null    object
 4   SALARY  420 non-null    object
dtypes: float64(1), object(4)
memory usage: 20.3+ KB

In [28]:
nba.dtypes

Player     object
Pos        object
Age       float64
TEAM       object
SALARY     object
dtype: object

In [32]:
#nba.get_dtype_counts()
nba.memory_usage()

Index      128
Player    4136
Pos       4136
Age       4136
TEAM      4136
SALARY    4136
dtype: int64

In [33]:
nba.describe()

              Age
count  476.000000
mean    26.594538
std      4.382440
min     19.000000
25%     23.000000
50%     26.000000
75%     29.000000
max     39.000000

## quick summary

In [16]:
nba.describe()

              Age
count  476.000000
mean    26.594538
std      4.382440
min     19.000000
25%     23.000000
50%     26.000000
75%     29.000000
max     39.000000

But: although Series and Dataframes share a lot they sometimes operate in a different way so lets see 1 example:

In [38]:
ser = pd.Series([1,2,3,4])
print("Series sum is sum of all numbers:", ser.sum())
ser
print (ser.sum(axis = "columns")) # its not exist

Series sum is sum of all numbers: 10
10

In [40]:
# lets create a dataframe to see the different
dict1 = {"City": ["NY", "LA", "Bos"], "Date":["1/1/2000", "1/2/2000", "1/3/2000"], "Value": [100,200,300]}
df = pd.DataFrame(data = dict1)
print (df.sum(axis = "index")) # equivilant to axis = 0
print(df.sum(axis = "columns"))

City                      NYLABos
Date     1/1/20001/2/20001/3/2000
Value                         600
dtype: object
0    100
1    200
2    300
dtype: int64

C:\Users\Gidi\AppData\Local\Temp/ipykernel_10844/932388249.py:5: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(df.sum(axis = "columns"))

## selecting one column

first way:

In [46]:
nba.Player.head()# ; return a series
# if you want to hide the output there is 3 option 
# add semicolon 
#Output=None
#double click to colapse the output

0       Stephen Curry
1        James Harden
2        Kevin Durant
3    DeMarcus Cousins
4        LeBron James
Name: Player, dtype: object

In [ ]:
# I dont like this way so much because its NOT working when you have a column name with spaces i.e a column: Player Name
#we will see an example later

Second way:

In [47]:
nba["TEAM"].head() # always work

0    Golden State Warriors
1          Houston Rockets
2    Oklahoma City Thunder
3         Sacramento Kings
4      Cleveland Cavaliers
Name: TEAM, dtype: object

In [24]:
type(nba["Player"]) # return Series so we can cahin methods and all attr. worked on Series you can assign

pandas.core.series.Series

## Selecting multiple columns

In [50]:
nba[["Player", "TEAM", "SALARY"]].head(10) # you can reverse the oreder if you want the team will appear first
#return dataframe
# you can add as much column as you want

              Player                    TEAM      SALARY
0      Stephen Curry   Golden State Warriors  11,370,786
1       James Harden         Houston Rockets  15,756,438
2       Kevin Durant   Oklahoma City Thunder  20,158,622
3   DeMarcus Cousins        Sacramento Kings  15,851,950
4       LeBron James     Cleveland Cavaliers  22,970,500
5     Damian Lillard  Portland Trail Blazers   4,236,287
6      Anthony Davis    New Orleans Pelicans   7,070,730
7      DeMar DeRozan         Toronto Raptors  10,050,000
8  Russell Westbrook   Oklahoma City Thunder  16,744,218
9        Paul George          Indiana Pacers  17,120,106

## add new column to an existing dataframe

In [55]:
nba["Type of Sport"] = "Basketball"
nba.head(2)

,Player,Pos,Age,Sport,Sport,Country,TEAM,SALARY,Type of Sport
0,Stephen Curry,PG,27.0,Basketball,Basketball,U.S,Golden State Warriors,"11,370,786",Basketball
1,James Harden,SG,26.0,Basketball,Basketball,U.S,Houston Rockets,"15,756,438",Basketball

In [58]:
#insert column in a specific place:
#nba.insert(loc=3, column="Sport", value="Basketball", allow_duplicates=False) # the column added permenantly so we dont need the inplace = True
# loc represent the index position of the columns so Players is at position 0 etc..
# pay attention there is a parameter allow_duplicate that assign to False. if for any reason you want to rewrite the exixting columne turn it to True
nba.insert(loc=4, column="ORGAN", value="U.N")
nba.head()

,Player,Pos,Age,Sport,ORGAN,Sport,Country,TEAM,SALARY,Type of Sport
0,Stephen Curry,PG,27.0,Basketball,U.N,Basketball,U.S,Golden State Warriors,"11,370,786",Basketball
1,James Harden,SG,26.0,Basketball,U.N,Basketball,U.S,Houston Rockets,"15,756,438",Basketball
2,Kevin Durant,SF,27.0,Basketball,U.N,Basketball,U.S,Oklahoma City Thunder,"20,158,622",Basketball
3,DeMarcus Cousins,C,25.0,Basketball,U.N,Basketball,U.S,Sacramento Kings,"15,851,950",Basketball
4,LeBron James,SF,31.0,Basketball,U.N,Basketball,U.S,Cleveland Cavaliers,"22,970,500",Basketball

# Broadcasting

In [29]:
nba["Age"].head(2)

0    27.0
1    26.0
Name: Age, dtype: float64

In [31]:
nba["Age"]+5 
nba["Age"].add(5,fill_value=nba["Age"].mean())

0      32.000000
1      31.000000
2      32.000000
3      30.000000
4      36.000000
5      30.000000
6      27.000000
7      31.000000
8      32.000000
9      30.000000
10     31.000000
11     30.000000
12     36.000000
13     31.000000
14     29.000000
15     34.000000
16     31.000000
17     30.000000
18     29.000000
19     25.000000
20     32.000000
21     31.000000
22     30.000000
23     30.000000
24     28.000000
25     29.000000
26     32.000000
27     35.000000
28     36.000000
29     39.000000
         ...
487    31.594538
488    31.594538
489    31.594538
490    31.594538
491    31.594538
492    31.594538
493    31.594538
494    31.594538
495    31.594538
496    31.594538
497    31.594538
498    31.594538
499    31.594538
500    31.594538
501    31.594538
502    31.594538
503    31.594538
504    31.594538
505    31.594538
506    31.594538
507    31.594538
508    31.594538
509    31.594538
510    31.594538
511    31.594538
512    31.594538
513    31.594538
514    31.594538
515    31.594538
516    31.594538
Name: Age, Length: 517, dtype: float64

In [63]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 517 entries, 0 to 516
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Player             517 non-null    object
 1   Pos                476 non-null    object
 2   Age                476 non-null    float64
 3   Sport              517 non-null    object
 4   ORGAN              517 non-null    object
 5   Sport              517 non-null    object
 6   Country            517 non-null    object
 7   TEAM               420 non-null    object
 8   SALARY             420 non-null    object
 9   Type of Sport      517 non-null    object
 10  sub_age            476 non-null    float64
 11  Age divided by 10  476 non-null    float64
dtypes: float64(3), object(9)
memory usage: 48.6+ KB

In [62]:
nba["Age"]-10
nba["Age"].sub(10)
nba["sub_age"] = nba["Age"].sub(10)

nba["Age"].div(10)
nba["Age divided by 10"] = nba["Age"] / 10

nba.head()

,Player,Pos,Age,Sport,ORGAN,Sport,Country,TEAM,SALARY,Type of Sport,sub_age,Age divided by 10
0,Stephen Curry,PG,27.0,Basketball,U.N,Basketball,U.S,Golden State Warriors,"11,370,786",Basketball,17.0,2.7
1,James Harden,SG,26.0,Basketball,U.N,Basketball,U.S,Houston Rockets,"15,756,438",Basketball,16.0,2.6
2,Kevin Durant,SF,27.0,Basketball,U.N,Basketball,U.S,Oklahoma City Thunder,"20,158,622",Basketball,17.0,2.7
3,DeMarcus Cousins,C,25.0,Basketball,U.N,Basketball,U.S,Sacramento Kings,"15,851,950",Basketball,15.0,2.5
4,LeBron James,SF,31.0,Basketball,U.N,Basketball,U.S,Cleveland Cavaliers,"22,970,500",Basketball,21.0,3.1

# dealin with NULL values

## dropna method

In [36]:
nba = pd.read_csv("nbasalariespoints.csv", usecols = ["Player", "Pos", "Age", "TEAM", "SALARY", "TOV","PF"])
nba.shape

(517, 7)

In [67]:
nba.dropna(how="all")# look at default parameters especially inplace=False

,Player,Pos,Age,Sport,ORGAN,Sport,Country,TEAM,SALARY,Type of Sport,sub_age,Age divided by 10
0,Stephen Curry,PG,27.0,Basketball,U.N,Basketball,U.S,Golden State Warriors,"11,370,786",Basketball,17.0,2.7
1,James Harden,SG,26.0,Basketball,U.N,Basketball,U.S,Houston Rockets,"15,756,438",Basketball,16.0,2.6
2,Kevin Durant,SF,27.0,Basketball,U.N,Basketball,U.S,Oklahoma City Thunder,"20,158,622",Basketball,17.0,2.7
3,DeMarcus Cousins,C,25.0,Basketball,U.N,Basketball,U.S,Sacramento Kings,"15,851,950",Basketball,15.0,2.5
4,LeBron James,SF,31.0,Basketball,U.N,Basketball,U.S,Cleveland Cavaliers,"22,970,500",Basketball,21.0,3.1
...,...,...,...,...,...,...,...,...,...,...,...,...
512,Jarrid Famous,NaN,NaN,Basketball,U.N,Basketball,U.S,Memphis Grizzlies,"525,093",Basketball,NaN,NaN
513,Shannon Scott,NaN,NaN,Basketball,U.N,Basketball,U.S,Toronto Raptors,"525,093",Basketball,NaN,NaN
514,Ronald Roberts Jr.,NaN,NaN,Basketball,U.N,Basketball,U.S,Toronto Raptors,"525,093",Basketball,NaN,NaN
515,Terran Petteway,NaN,NaN,Basketball,U.N,Basketball,U.S,Atlanta Hawks,"525,093",Basketball,NaN,NaN
516,JJ Hickson,NaN,NaN,Basketball,U.N,Basketball,U.S,Washington Wizards,"273,038",Basketball,NaN,NaN

In [35]:
nba.dropna(subset=['TOV',"PF"], how="any", inplace=True)
nba.shape

(476, 7)

## fillna

In [69]:
nba.fillna(0).tail()

,Player,Pos,Age,Sport,ORGAN,Sport,Country,TEAM,SALARY,Type of Sport,sub_age,Age divided by 10
512,Jarrid Famous,0,0.0,Basketball,U.N,Basketball,U.S,Memphis Grizzlies,"525,093",Basketball,0.0,0.0
513,Shannon Scott,0,0.0,Basketball,U.N,Basketball,U.S,Toronto Raptors,"525,093",Basketball,0.0,0.0
514,Ronald Roberts Jr.,0,0.0,Basketball,U.N,Basketball,U.S,Toronto Raptors,"525,093",Basketball,0.0,0.0
515,Terran Petteway,0,0.0,Basketball,U.N,Basketball,U.S,Atlanta Hawks,"525,093",Basketball,0.0,0.0
516,JJ Hickson,0,0.0,Basketball,U.N,Basketball,U.S,Washington Wizards,"273,038",Basketball,0.0,0.0

In [70]:
nba["TEAM"].fillna("No Team", inplace = True)
nba.tail()

C:\Users\Gidi\anaconda3\lib\site-packages\pandas\core\generic.py:6392: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return self._update_inplace(result)

,Player,Pos,Age,Sport,ORGAN,Sport,Country,TEAM,SALARY,Type of Sport,sub_age,Age divided by 10
512,Jarrid Famous,NaN,NaN,Basketball,U.N,Basketball,U.S,Memphis Grizzlies,"525,093",Basketball,NaN,NaN
513,Shannon Scott,NaN,NaN,Basketball,U.N,Basketball,U.S,Toronto Raptors,"525,093",Basketball,NaN,NaN
514,Ronald Roberts Jr.,NaN,NaN,Basketball,U.N,Basketball,U.S,Toronto Raptors,"525,093",Basketball,NaN,NaN
515,Terran Petteway,NaN,NaN,Basketball,U.N,Basketball,U.S,Atlanta Hawks,"525,093",Basketball,NaN,NaN
516,JJ Hickson,NaN,NaN,Basketball,U.N,Basketball,U.S,Washington Wizards,"273,038",Basketball,NaN,NaN

In [ ]:
# sidenot if you know that you want to remove/fill null values you can add it wehen opening the file see next cell

# astype method

In [71]:
nba = pd.read_csv("nbasalariespoints.csv", usecols = ["Player", "Pos","Age", "TEAM", "SALARY"]).dropna(how="all")
nba["SALARY"].fillna(0, inplace = True)
nba["TEAM"].fillna("No Team", inplace = True)
nba.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 517 entries, 0 to 516
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Player  517 non-null    object
 1   Pos     476 non-null    object
 2   Age     476 non-null    float64
 3   TEAM    517 non-null    object
 4   SALARY  517 non-null    object
dtypes: float64(1), object(4)
memory usage: 24.2+ KB

In [72]:
nba["SALARY"] = nba["SALARY"].str.replace(",","") 
nba["SALARY"] = nba["SALARY"].astype(float) # not working because of the coma so you first need to remove it and then change the type

In [73]:
nba.dtypes

Player     object
Pos        object
Age       float64
TEAM       object
SALARY    float64
dtype: object

In [76]:
nba["TEAM"].nunique()

32

In [47]:
nba.Pos.nunique()

7

In [49]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 517 entries, 0 to 516
Data columns (total 5 columns):
Player    517 non-null object
Pos       476 non-null object
Age       476 non-null float64
TEAM      517 non-null object
SALARY    420 non-null float64
dtypes: float64(2), object(3)
memory usage: 24.2+ KB

In [77]:
nba["Pos"] = nba["Pos"].astype("category")
nba["TEAM"] = nba["TEAM"].astype("category")
nba.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 517 entries, 0 to 516
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Player  517 non-null    object
 1   Pos     476 non-null    category
 2   Age     476 non-null    float64
 3   TEAM    517 non-null    category
 4   SALARY  420 non-null    float64
dtypes: category(2), float64(2), object(1)
memory usage: 18.8+ KB

In [79]:
nba.memory_usage().sum() # if you eant to grab only the memory usage. any how see the difference betwwen this one and the former

19262

# sorting

## sort_values / index

In [85]:
nba.sort_values(by = "SALARY", ascending=False).head(8)

             Player Pos   Age                   TEAM      SALARY
36      Kobe Bryant  SF  37.0     Los Angeles Lakers  25000000.0
4      LeBron James  SF  31.0    Cleveland Cavaliers  22970500.0
12  Carmelo Anthony  SF  31.0        New York Knicks  22875000.0
82    Dwight Howard   C  30.0        Houston Rockets  22359364.0
28       Chris Bosh  PF  31.0             Miami Heat  22192730.0
27       Chris Paul  PG  30.0            LA Clippers  21468695.0
2      Kevin Durant  SF  27.0  Oklahoma City Thunder  20158622.0
47     Derrick Rose  PG  27.0          Chicago Bulls  20093064.0

In [59]:
nba.sort_values(by = ["Age"], inplace=True)

In [86]:
nba.sort_index(inplace=True)
nba.head()

             Player Pos   Age                   TEAM      SALARY
0     Stephen Curry  PG  27.0  Golden State Warriors  11370786.0
1      James Harden  SG  26.0        Houston Rockets  15756438.0
2      Kevin Durant  SF  27.0  Oklahoma City Thunder  20158622.0
3  DeMarcus Cousins   C  25.0       Sacramento Kings  15851950.0
4      LeBron James  SF  31.0    Cleveland Cavaliers  22970500.0

## rank method

In [61]:
nba["Salary_rank"] = nba["SALARY"].rank().astype(float)

In [62]:
nba.head()

              Player Pos   Age                    TEAM     SALARY  Salary_rank
349       Tyus Jones  PG  19.0  Minnesota Timberwolves  1282080.0        121.0
394    Rashad Vaughn  SG  19.0         Milwaukee Bucks  1733040.0        153.0
445     Kevon Looney  PF  19.0   Golden State Warriors  1131960.0         96.0
92   Emmanuel Mudiay  PG  19.0          Denver Nuggets  3102240.0        227.0
263  Justise Winslow  SF  19.0              Miami Heat  2481720.0        193.0

In [64]:
nba.sort_values(by = "SALARY",ascending=True).head()

                     Player Pos   Age               TEAM   SALARY  Salary_rank
395  Thanasis Antetokounmpo  SF  23.0    New York Knicks  30888.0          1.0
405          Cory Jefferson  PF  25.0       Phoenix Suns  49709.0          2.0
367         Orlando Johnson  SG  26.0       Phoenix Suns  55722.0          4.0
451         Elliot Williams  PG  26.0  Memphis Grizzlies  55722.0          4.0
390            Phil Pressey  PG  24.0       Phoenix Suns  55722.0          4.0